#include <iostream>
using namespace std;

int main() {// ฟังก์ชันหลักของโปรแกรม
    // for loop to print "Hi" 10 times
    // for loop ใช้ในการทำคำสั่งซ้ำกันหลายครั้ง โดยกำหนดเงื่อนไขการเริ่มต้น การทำงาน และการเพิ่มค่าของตัวแปร

  	// for loop to print "Hi" 5 times
    for (int i = 1; i <= 10; i++) { // ใช้ในการทำคำสั่งภายในบล็อก {} การททำงานคือ
      // เริ่มต้นที่ i = 1 ให้ตรวจสอบว่า i น้อยกว่าหรือเท่ากับ หรือไม่ ถ้าจริงให้ทำงานในลูป ถ้าเท็จให้ออกจากลูป
      //หลังตรวจสอบแต่ละรอบเสร็จ จะทำการเพิ่มค่า i ทีละ1 ลูปจะรันทั้ง หมด 10 รอบตั้งแต่ i=1 ถึง i=10
      	cout << "Hi => i = " << i << endl; //ลูปจะแสดงข้อความ  Hi => i =ตามด้วยค่าของ i 
    }
  
    return 0;
}