#include<iostream>// ใช้สำหรับการแสดงผลและรับค่าจากผู้ใช้
using namespace std;// ใช้สำหรับการแสดงผลและรับค่าจากผู้ใช้

int main() { //ฟังก์ชันหลักของโปรแกรม 
    int A = 0; //บรรทัดนี้กำหนดตัวแปรเริ่มต้น
    cout << "Please enter a number for A: " << endl; //บรรทัดดนี้บอกให้ผู้ใช้งานป้อนตัวเลขเพื่อกำหนดค่าให้กับ  A
    cin >> A; //รับค่าจากผู้ใช้ทางคีย์บอร์ด แล้วเก็บไว้ในตัวแปร

    if (A == 8) { //ตรวจสอบค่าว่า Aมีค่าเท่ากับ 8 หรือไม่ ถ้าเป็นจริงให้ทำคำสั่งในบล็อกด้านล่าง 
        cout << "A is 8" << endl; // ถ้าเงื่อนไขเป็นจริง จะแสดงข้อความว่า A is 8 บนหน้าจอ
    } else if (A > 8) { //ถ้า A ไม่เท่ากับ8 แต่มากกว่า 8 จะเข้าสุ่เงื่อนไขนี้
        cout << "A is greater than 8" << endl; //แสดงข้อความ A is greater than 8 สำหรับเงื่อนไขด้านบน
    } else { //กรณีที่ A ไม่ตรงกับเงื่อนไขใดเลย จะเข้าสู่เงื่อนไขนี้แทน
        cout << "A is less than 8" << endl; // แสดงข้อความ A is less than 8
    }// จบเงื่อนไข if-else

    return 0; // จบโปรแกรมและส่งค่ากลับ 
} // ปิดฟังก์ชัน main