#include<iostream>
using namespace std;

int main (){ //ฟังก์ชัน main จุดเริ่มต้นของโปรแกรม 
    int A = 0; //ประกาศตัวแปรชนิด int ให้ชื่อว่า A กำหนดให้ค่าเป็น 0 
    cout<<"Please enter a number to A: "<< endl; //แสดงข้อความเพื่อให้ผู้ใช้งานป้อนข้อมูล 
    cin >> A; // รับค่าจากผู้ใช้งานป้อนจากคัย์บอร์ด แล้วเก็บค่าไว้

    if(A<5){ //ตรวจสอบว่า  ค่าของ  A น้อยกว่า 5 หรือไม่ ถ้าจริงให้ทำคำสั่งใน {} ถ้าน้อยกว่า 5 จะข้ามไป
        cout<<"Condition met"<<endl; //ถ้าเงื่อนไข A   น้อยกว่า 5 เป็นจริงจะพิมพ์  Condition met
    }// ถ้าเงื่อนไขไม่เป็นจริงจะข้ามไป
    
    return 0; // จบโปรแกรมโดยคืนค่า 0
}