#include <iostream>
using namespace std;

int main() {// ฟังก์ชันหลักของโปรแกรม
  	// while loop to print numbers from 1 to 5
    int i = 0; // สร้างงตัวแปร i ชนิด int ให้ค่าเริ่มเป็น 0
    while (i < 12) { // loop while จะทำงาน ตราบใดที่เงืื่อนไข i<12 เป็นจริง 
      // i น้อยยกว่า 12 เข้าทำงานในลูป ถ้า i น้อยกว่าหรือเท่ากับ 12 ให้ออกจากลูป 
        cout << "Hi  => i = " << i << endl; //แสดงข้อความ Hi => i = ตามด้วยค่าของ  i 
       i++;// i = i+1 เพิ่มค่าของ i ทีละ 1 ทุกครั้งที่ลูปรัน
    }

   return 0;// คืนค่า 0 เพื่อบอกว่าโปรแกรมทำงานสำเร็จ 0 หมายถึงสำเร็จ และค่าที่ไม่ใช่ 0 หมายถึงเกิดข้อผิดพลาด

}// ฟังก์ชันหลักของโปรแกรมจบที่นี่
